{
  "statistics": [
    {
      "text": "it's a three trillion dollar industry if we just extrapolate the trend rate of growth and the number of wallets and all of that stuff we get to 100 trillion by 2034 we're 3% of the way there",
      "description": "Prediction of crypto market growth from a current value of 3 trillion to 100 trillion by 2034, representing 3% of the projected total.",
      "entities": [
        "Cryptocurrency"
      ]
    },
    {
      "text": "Bitcoin is at 92,000",
      "description": "Current market price of Bitcoin.",
      "entities": [
        "Bitcoin"
      ]
    },
    {
      "text": "did buy Bitcoin at 68 8,000 November of 2021 rode it down to 17,000",
      "description": "Personal experience of buying Bitcoin at 68,000 in November 2021 and seeing its price drop to 17,000.",
      "entities": [
        "Bitcoin",
        "Speaker"
      ]
    },
    {
      "text": "my general thesis is we will rally into year end we will correct at some point there's a bunch of hedge funds and raas and others who are into this who will need to take a bit of profits into year end I think we'll get a bit of a ShakeOut Global liquidity slowing down somewhat and then we should re accelerate into the end of tax season so my view is Bitcoin easily gets to 100 this year um and probably probably is you know 150 plus by March before it corrects again and then we finish the year after a larger correction with a very strong rally into the end so that's that's how I think it plays out probabilistically so when you say a correction we're at 150 it corrects back to 80 yeah maybe something like that yeah maybe less maybe you know 30% correction so back down to 100 kind of make sense to me right um and it'll feel miserable and people say has the cycle peaked and all of that noise right and then usually we end the second year after the presidential election cycle very strong and then it Peaks out sometimes",
      "description": "Prediction of Bitcoin's price movement throughout the year, including a potential rally to 100, a rise to 150 by March, a correction, and a strong rally at year-end.  A range of potential outcomes is given (150, 250, 450).",
      "entities": [
        "Bitcoin"
      ]
    },
    {
      "text": "if I give a range of targets as opposed to pinpointing a Target worst Cas is 150 my base case is 250 and in an obscene bull market because everybody's buying driven by a change of Regulation then it could go as high as 450",
      "description": "Provides a range of price targets for Bitcoin, based on different market scenarios.",
      "entities": [
        "Bitcoin"
      ]
    },
    {
      "text": "I think salana finishes this year closer to 400 than it is to 200 so I think we got this year six weeks ago maybe 350 I mean it's a higher bass so it should do better um so I expect that to happen um I'm I think again it'll follow the same kind of price path as Bitcoin but it should outperform all of the way it's been in this consolidation versus Bitcoin uh sideways consolidation the next leg should be altcoin season and salana should be the king of the major alts so I'm kind of expecting salana from here to probably get to over over a th000 12 1250 something like that",
      "description": "Price prediction for Solana, suggesting it will end the year closer to 400 than 200, and potentially reach 1250.",
      "entities": [
        "Solana"
      ]
    },
    {
      "text": "unemployment's at an all-time low stock markets at an all-time high",
      "description": "States that unemployment is at an all-time low and stock markets are at an all-time high.",
      "entities": [
        "Unemployment",
        "Stock Market"
      ]
    },
    {
      "text": "The Institute of Supply manager survey which is the guide to the global business cycle it's actually been below 50 which means it's in sort of contraction for the longest period in history now I think",
      "description": "ISM survey indicating global business cycle contraction for an extended period.",
      "entities": [
        "Institute of Supply Management (ISM)",
        "ISM Survey"
      ]
    },
    {
      "text": "we've got six years left to make as much money as we can before we don't understand how the economy works anymore",
      "description": "A prediction that there are six years left before a significant shift in the economy occurs due to technological advancements.",
      "entities": []
    },
    {
      "text": "if an economy is driven by if economic Trend rate of economic growth is driven by population growth plus productivity growth and debt growth by the time you change this aging population which is slowing Trend rate of GDP down replace that with infinite robots and infinite AI we've replaced the population component same with productivity by lowering energy cost we end up with ridiculous growth",
      "description": "Explains the factors driving economic growth and how technological advancements can disrupt this.",
      "entities": []
    }
  ]
}